let arrRiddles = {};
class Riddles {
    constructor(question, a, b, c, d, rightAnswer, winning) {
        this.question = question;
        this.a = a;
        this.b = b;
        this.c = c;
        this.d = d;
        this.rightAnswer = rightAnswer;
        this.winning = winning;
    }
    /*question_1: 'Кто проживает на дне океана?',
    answers_1:
        {
            a: 'Губка Боб Квадратные штаны',
            b: 'Огромный аллигатор',
            c: 'Русалочка',
            d: 'Автор этой игры'
        },
    question_2: 'Кто сказал фразу "Мне нужна твоя одежда, сапоги и мотоцикл..."?',
    answers_2:
        {
            a: 'Губка Боб Квадратные штаны',
            b: 'Терминатор',
            c: 'Сосед из 57 квартиры',
            d: 'Арнольд Шварцнеггер'
        },
    question_3: 'Кто ведущий программы "Галилео"?',
    answers_3:
        {
            a: 'Александр Пушной',
            b: 'Свинка Пепа',
            c: 'Уилл Смит',
            d: 'Галилей'
        },
    question_4: 'Кто лысый ведущий передачи "Разрушители мифов"?',
    answers_4:
        {
            a: 'Адам Севидж',
            b: 'Джейми Хайнеман',
            c: 'Тори Беличи',
            d: 'Гран Имахара'
        },
    question_5: 'Когда всё это кончится?',
    answers_5:
        {
            a: 'В следующем году',
            b: 'Никогда',
            c: 'Уже закончилась',
            d: 'Закончить сейчас, ведь ты управляешь реальностью!'
        },
    */
}

// let riddles_1 = new Riddles('Кто проживает на дне океана?', 'Губка Боб Квадратные штаны', 'Огромный аллигатор', 'Русалочка', 'Автор этой игры', '100 рублей');
// let riddles_2 = new Riddles('Кто сказал фразу "Мне нужна твоя одежда, сапоги и мотоцикл..."?', 'Губка Боб Квадратные штаны', 'Терминатор', 'Сосед из 57 квартиры', 'Арнольд Шварцнеггер', '500 рублей');
// let riddles_3 = new Riddles('Кто ведущий программы "Галилео"?', 'Александр Пушной', 'Свинка Пепа', 'Уилл Смит', 'Галилей', '10000 рублей');
// let riddles_4 = new Riddles('Кто лысый ведущий передачи "Разрушители мифов"?', 'Адам Севидж', 'Джейми Хайнеман', 'Тори Беличи', 'Гран Имахара', '100000 рублей');
// let riddles_5 = new Riddles('Когда всё это кончится?', 'В следующем году', 'Никогда', 'Уже закончилась', 'Закончить сейчас, ведь ты управляешь реальностью!', '1000000 рублей');